timings.org
* Blackscholes

| Numba Version |      Python | Cuda |  NumPy Time |  Numba Time |
|---------------+-------------+------+-------------+-------------|
|         0.9.0 | 1166.122198 |      | 1163.949895 | 6364.418793 |
|         0.8.1 | 1170.525312 |      | 1172.363305 |  365.799403 |
|         0.8.0 | 1150.239301 |      | 1150.786304 |  366.230106 |

** Math functions used by Blackscholes

- fabs
- log
- exp
- sqrt

* Mandel

|                 Numba Version | Vectorize | CU |        Autojit |
|-------------------------------+-----------+----+----------------|
|                         0.9.0 |           |    | 0.413378000259 |
|                               |           |    | 0.377733945847 |
|                               |           |    | 0.345150947571 |
|-------------------------------+-----------+----+----------------|
|                         0.8.1 |           |    | 0.267106056213 |
|                               |           |    | 0.260750055313 |
|                               |           |    | 0.259781122208 |
|-------------------------------+-----------+----+----------------|
|                         0.8.0 |           |    |  0.27729010582 |
|                               |           |    | 0.268536806107 |
|                               |           |    | 0.255920171738 |
|-------------------------------+-----------+----+----------------|
| Removed the autojit decorator |           |    |  8.45351982117 |

* Mandel (with larger image, multiplied each dimension by 10)

| Numba Version |       Autojit |
|---------------+---------------|
|         0.9.0 | 6.01062583923 |
|               | 5.87451314926 |
|               | 5.84532213211 |
|---------------+---------------|
|         0.8.1 | 5.80409097672 |
|               | 5.82420301437 |
|               | 5.83612799644 |
|---------------+---------------|
|         0.8.0 | 5.81156802177 |
|               | 5.80174016953 |
|               | 5.8482170105  |

* Mandel with 1000 iterations (instead of the default 20)

| Numba Version |       Autojit |
|---------------+---------------|
|         0.9.0 | 2.02573299408 |
|               |  2.0584218502 |
|               |  2.0519490242 |
|---------------+---------------|
|         0.8.1 | 1.97202205658 |
|               | 1.95236301422 |
|               | 1.96435403824 |
|---------------+---------------|
|         0.8.0 | 1.97258806229 |
|               | 1.97673392296 |
|               | 1.97673392296 |

* Monte Carlo Pricer

| Numba Version | NumPy                  | Numba                  |
|---------------+------------------------+------------------------|
|         0.9.0 | 18.99 MStep per second | 21.67 MStep per second |
|               | 5.265635s              | 4.615251s              |
|---------------+------------------------+------------------------|
|         0.8.1 | 19.21 MStep per second | 13.37 MStep per second |
|               | 5.206505s              | 7.478213s              |
|---------------+------------------------+------------------------|
|         0.8.0 | 19.39 MStep per second | 16.03 MStep per second |
|               | 5.156585s              | 6.237782s              |

* nbody

| Numba Version | nbody                            | nbody Mark Harris                |
|---------------+----------------------------------+----------------------------------|
|         0.9.0 | 1825.900078 ms: 0.002692 GFLOP/s | 4066.952944 ms: 0.001209 GFLOP/s |
|         0.8.1 | 1817.068100 ms: 0.002705 GFLOP/s | 4067.687035 ms: 0.001208 GFLOP/s |
|         0.8.0 | 1903.918982 ms: 0.002582 GFLOP/s | 4039.033890 ms: 0.001217 GFLOP/s |

* Laplace 2D

Note: You have to break it after this first output

| Numba Version | Python                                          | Numba                                           |
|---------------+-------------------------------------------------+-------------------------------------------------|
|         0.9.0 | Jacobi relaxation Calculation: 4096 x 4096 mesh | Jacobi relaxation Calculation: 4096 x 4096 mesh |
|               | 0, 0.250000 (elapsed: 75.402862 s)              | 0, 0.250000 (elapsed: 2.813040 s)               |
|---------------+-------------------------------------------------+-------------------------------------------------|
|         0.8.1 |                                                 | Jacobi relaxation Calculation: 4096 x 4096 mesh |
|               |                                                 | 0, 0.250000 (elapsed: 2.644492 s)               |
|---------------+-------------------------------------------------+-------------------------------------------------|
|         0.8.0 |                                                 | Jacobi relaxation Calculation: 4096 x 4096 mesh |
|               |                                                 |     0, 0.250000 (elapsed: 2.636084 s)           |

