timings.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>timings</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="timings"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-11T15:21-0500"/>
<meta name="author" content="Aaron Meurer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">timings</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Blackscholes</a>
<ul>
<li><a href="#sec-1-1">1.1 Math functions used by Blackscholes</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Mandel</a></li>
<li><a href="#sec-3">3 Mandel (with larger image, multiplied each dimension by 10)</a></li>
<li><a href="#sec-4">4 Mandel with 1000 iterations (instead of the default 20)</a></li>
<li><a href="#sec-5">5 Monte Carlo Pricer</a></li>
<li><a href="#sec-6">6 nbody</a></li>
<li><a href="#sec-7">7 Laplace 2D</a></li>
<li><a href="#sec-8">8 Bubblesort</a></li>
<li><a href="#sec-9">9 Example</a></li>
<li><a href="#sec-10">10 Sum</a></li>
<li><a href="#sec-11">11 Sum (modified with 10000 x 10000)</a></li>
<li><a href="#sec-12">12 math-test.py</a>
<ul>
<li><a href="#sec-12-1">12.1 sqrt</a></li>
<li><a href="#sec-12-2">12.2 log</a></li>
<li><a href="#sec-12-3">12.3 exp</a></li>
<li><a href="#sec-12-4">12.4 fabs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Blackscholes</h2>
<div class="outline-text-2" id="text-1">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Numba Version</th><th scope="col" class="right">Python</th><th scope="col" class="left">Cuda</th><th scope="col" class="right">NumPy Time</th><th scope="col" class="right">Numba Time</th></tr>
</thead>
<tbody>
<tr><td class="right">0.9.0</td><td class="right">1166.122198</td><td class="left"></td><td class="right">1163.949895</td><td class="right">6364.418793</td></tr>
<tr><td class="right">0.8.1</td><td class="right">1170.525312</td><td class="left"></td><td class="right">1172.363305</td><td class="right">365.799403</td></tr>
<tr><td class="right">0.8.0</td><td class="right">1150.239301</td><td class="left"></td><td class="right">1150.786304</td><td class="right">366.230106</td></tr>
</tbody>
</table>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Math functions used by Blackscholes</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>fabs
</li>
<li>log
</li>
<li>exp
</li>
<li>sqrt
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mandel</h2>
<div class="outline-text-2" id="text-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Vectorize</th><th scope="col" class="left">CU</th><th scope="col" class="right">Autojit</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left"></td><td class="left"></td><td class="right">0.413378000259</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.377733945847</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.345150947571</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left"></td><td class="left"></td><td class="right">0.267106056213</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.260750055313</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.259781122208</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left"></td><td class="left"></td><td class="right">0.27729010582</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.268536806107</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left"></td><td class="right">0.255920171738</td></tr>
</tbody>
<tbody>
<tr><td class="left">Removed the autojit decorator</td><td class="left"></td><td class="left"></td><td class="right">8.45351982117</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Mandel (with larger image, multiplied each dimension by 10)</h2>
<div class="outline-text-2" id="text-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="right">Autojit</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="right">6.01062583923</td></tr>
<tr><td class="left"></td><td class="right">5.87451314926</td></tr>
<tr><td class="left"></td><td class="right">5.84532213211</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="right">5.80409097672</td></tr>
<tr><td class="left"></td><td class="right">5.82420301437</td></tr>
<tr><td class="left"></td><td class="right">5.83612799644</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="right">5.81156802177</td></tr>
<tr><td class="left"></td><td class="right">5.80174016953</td></tr>
<tr><td class="left"></td><td class="right">5.8482170105</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mandel with 1000 iterations (instead of the default 20)</h2>
<div class="outline-text-2" id="text-4">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="right">Autojit</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="right">2.02573299408</td></tr>
<tr><td class="left"></td><td class="right">2.0584218502</td></tr>
<tr><td class="left"></td><td class="right">2.0519490242</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="right">1.97202205658</td></tr>
<tr><td class="left"></td><td class="right">1.95236301422</td></tr>
<tr><td class="left"></td><td class="right">1.96435403824</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="right">1.97258806229</td></tr>
<tr><td class="left"></td><td class="right">1.97673392296</td></tr>
<tr><td class="left"></td><td class="right">1.97673392296</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Monte Carlo Pricer</h2>
<div class="outline-text-2" id="text-5">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">NumPy</th><th scope="col" class="left">Numba</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">18.99 MStep per second</td><td class="left">21.67 MStep per second</td></tr>
<tr><td class="left"></td><td class="left">5.265635s</td><td class="left">4.615251s</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left">19.21 MStep per second</td><td class="left">13.37 MStep per second</td></tr>
<tr><td class="left"></td><td class="left">5.206505s</td><td class="left">7.478213s</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left">19.39 MStep per second</td><td class="left">16.03 MStep per second</td></tr>
<tr><td class="left"></td><td class="left">5.156585s</td><td class="left">6.237782s</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> nbody</h2>
<div class="outline-text-2" id="text-6">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Numba Version</th><th scope="col" class="left">nbody</th><th scope="col" class="left">nbody Mark Harris</th></tr>
</thead>
<tbody>
<tr><td class="right">0.9.0</td><td class="left">1825.900078 ms: 0.002692 GFLOP/s</td><td class="left">4066.952944 ms: 0.001209 GFLOP/s</td></tr>
<tr><td class="right">0.8.1</td><td class="left">1817.068100 ms: 0.002705 GFLOP/s</td><td class="left">4067.687035 ms: 0.001208 GFLOP/s</td></tr>
<tr><td class="right">0.8.0</td><td class="left">1903.918982 ms: 0.002582 GFLOP/s</td><td class="left">4039.033890 ms: 0.001217 GFLOP/s</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Laplace 2D</h2>
<div class="outline-text-2" id="text-7">


<p>
Note: You have to break it after this first output
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Python</th><th scope="col" class="left">Numba</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">Jacobi relaxation Calculation: 4096 x 4096 mesh</td><td class="left">Jacobi relaxation Calculation: 4096 x 4096 mesh</td></tr>
<tr><td class="left"></td><td class="left">0, 0.250000 (elapsed: 75.402862 s)</td><td class="left">0, 0.250000 (elapsed: 2.813040 s)</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left"></td><td class="left">Jacobi relaxation Calculation: 4096 x 4096 mesh</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">0, 0.250000 (elapsed: 2.644492 s)</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left"></td><td class="left">Jacobi relaxation Calculation: 4096 x 4096 mesh</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">0, 0.250000 (elapsed: 2.636084 s)</td></tr>
</tbody>
</table>


</div>

</div>
