timings.org
* Bubblesort

| Numba Version | Output                  |
|---------------+-------------------------|
|         0.9.0 | Python 0.936146593094   |
|               | Numba 0.00115871429443  |
|               | Speedup 807.918395062 x |
|---------------+-------------------------|
|         0.8.1 | Python 0.892957282066   |
|               | Numba 0.00131599903107  |
|               | Speedup 678.539467725 x |
|---------------+-------------------------|
|         0.8.0 | Python 0.889819002151   |
|               | Numba 0.00108458995819  |
|               | Speedup 820.419731375 x |
|               |                         |

* Example

| Numba Version | Output                        |
|---------------+-------------------------------|
|         0.9.0 | Time for LLVM code = 0.014746 |
|               | Time for convolve = 0.040764  |
|---------------+-------------------------------|
|         0.8.1 | Time for LLVM code = 0.017178 |
|               | Time for convolve = 0.037990  |
|---------------+-------------------------------|
|         0.8.0 | Time for LLVM code = 0.017115 |
|               | Time for convolve = 0.038151  |
|               |                               |

* Sum

Don't trust this one. It has very high variation.

| Numba Version | Output                                                           |
|---------------+------------------------------------------------------------------|
|         0.9.0 | Result from python is -131.101832227 in 5.23710250854 (msec)     |
|               | Result from compiled is -131.101832227 in 0.0278949737549 (msec) |
|               | Speed up is 187.743589744                                        |
|---------------+------------------------------------------------------------------|
|         0.8.1 | Result from python is 2.56392423422 in 5.19490242004 (msec)      |
|               | Result from compiled is 2.56392423422 in 0.0128746032715 (msec)  |
|               | Speed up is 403.5                                                |
|---------------+------------------------------------------------------------------|
|         0.8.0 | Result from python is 36.5373168197 in 5.30195236206 (msec)      |
|               | Result from compiled is 36.5373168197 in 0.0200271606445 (msec)  |
|               | Speed up is 264.738095238                                        |
|               |                                                                  |

* Sum (modified with 10000 x 10000)

| Numba Version | Output                                                            |
|---------------+-------------------------------------------------------------------|
|         0.9.0 | 1. Result from compiled is 17807.005868 in 96.0628986359 (msec)   |
|               | 2. Result from compiled is -439.857393209 in 147.600889206 (msec) |
|               | 3. Result from compiled is -11188.4391763 in 95.5100059509 (msec) |
|---------------+-------------------------------------------------------------------|
|         0.8.1 | 1. Result from compiled is -13518.931727 in 97.051858902 (msec)   |
|               | 2. Result from compiled is 1944.19539822 in 97.5658893585 (msec)  |
|               | 3. Result from compiled is -9291.88723295 in 96.6360569 (msec)    |
|---------------+-------------------------------------------------------------------|
|         0.8.0 | 1. Result from compiled is 8005.61197178 in 97.9011058807 (msec)  |
|               | 2. Result from compiled is -2891.66920985 in 96.116065979 (msec)  |
|               | 3. Result from compiled is -5676.66598645 in 97.7380275726 (msec) |
|               |                                                                   |

* math-test.py

Note: these algorithms do not scale linearly with N

All times are in seconds

** sqrt

N = 10000

| Numba Version |           Python |           Numba |
|---------------+------------------+-----------------|
|         0.9.0 | 0.00170588493347 | 0.0743989944458 |
|               | 0.00174593925476 | 0.0611250400543 |
|               | 0.00184512138367 | 0.0618748664856 |
|               | 0.00171184539795 | 0.0614089965820 |
|---------------+------------------+-----------------|
|         0.8.1 | 0.00159692764282 | 0.0599839687347 |
|               | 0.00173020362854 | 0.0594990253448 |
|               | 0.00174212455750 | 0.0599339008331 |
|               | 0.00250196456909 | 0.0624308586121 |
|---------------+------------------+-----------------|
|         0.8.0 | 0.00171399116516 | 0.0785949230194 |
|               | 0.00183892250061 | 0.0675189495087 |
|               | 0.00175094604492 | 0.0603921413422 |
|               | 0.00170612335205 | 0.0645940303802 |


** log

N = 10000

| Numba Version |           Python |           Numba |
|---------------+------------------+-----------------|
|         0.9.0 | 0.00211095809937 | 0.0557370185852 |
|               | 0.00212287902832 | 0.0526371002197 |
|               | 0.00207209587097 | 0.0515320301056 |
|               | 0.00221204757690 | 0.0550639629364 |
|---------------+------------------+-----------------|
|         0.8.1 | 0.00210595130920 | 0.0521640777588 |
|               | 0.00208806991577 | 0.0521259307861 |
|               | 0.00212788581848 | 0.0508341789246 |
|               | 0.00238919258118 | 0.0524239540100 |
|---------------+------------------+-----------------|
|         0.8.0 | 0.00207805633545 | 0.0496821403503 |
|               | 0.00223398208618 | 0.0613958835602 |
|               | 0.00210213661194 | 0.0539150238037 |
|               | 0.00217890739441 | 0.0513410568237 |


