timings.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Bubblesort</h2>
<div class="outline-text-2" id="text-8">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Output</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">Python 0.936146593094</td></tr>
<tr><td class="left"></td><td class="left">Numba 0.00115871429443</td></tr>
<tr><td class="left"></td><td class="left">Speedup 807.918395062 x</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left">Python 0.892957282066</td></tr>
<tr><td class="left"></td><td class="left">Numba 0.00131599903107</td></tr>
<tr><td class="left"></td><td class="left">Speedup 678.539467725 x</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left">Python 0.889819002151</td></tr>
<tr><td class="left"></td><td class="left">Numba 0.00108458995819</td></tr>
<tr><td class="left"></td><td class="left">Speedup 820.419731375 x</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Example</h2>
<div class="outline-text-2" id="text-9">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Output</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">Time for LLVM code = 0.014746</td></tr>
<tr><td class="left"></td><td class="left">Time for convolve = 0.040764</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left">Time for LLVM code = 0.017178</td></tr>
<tr><td class="left"></td><td class="left">Time for convolve = 0.037990</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left">Time for LLVM code = 0.017115</td></tr>
<tr><td class="left"></td><td class="left">Time for convolve = 0.038151</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Sum</h2>
<div class="outline-text-2" id="text-10">


<p>
Don't trust this one. It has very high variation.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Output</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">Result from python is -131.101832227 in 5.23710250854 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Result from compiled is -131.101832227 in 0.0278949737549 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Speed up is 187.743589744</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left">Result from python is 2.56392423422 in 5.19490242004 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Result from compiled is 2.56392423422 in 0.0128746032715 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Speed up is 403.5</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left">Result from python is 36.5373168197 in 5.30195236206 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Result from compiled is 36.5373168197 in 0.0200271606445 (msec)</td></tr>
<tr><td class="left"></td><td class="left">Speed up is 264.738095238</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Sum (modified with 10000 x 10000)</h2>
<div class="outline-text-2" id="text-11">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="left">Output</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="left">1. Result from compiled is 17807.005868 in 96.0628986359 (msec)</td></tr>
<tr><td class="left"></td><td class="left">2. Result from compiled is -439.857393209 in 147.600889206 (msec)</td></tr>
<tr><td class="left"></td><td class="left">3. Result from compiled is -11188.4391763 in 95.5100059509 (msec)</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="left">1. Result from compiled is -13518.931727 in 97.051858902 (msec)</td></tr>
<tr><td class="left"></td><td class="left">2. Result from compiled is 1944.19539822 in 97.5658893585 (msec)</td></tr>
<tr><td class="left"></td><td class="left">3. Result from compiled is -9291.88723295 in 96.6360569 (msec)</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="left">1. Result from compiled is 8005.61197178 in 97.9011058807 (msec)</td></tr>
<tr><td class="left"></td><td class="left">2. Result from compiled is -2891.66920985 in 96.116065979 (msec)</td></tr>
<tr><td class="left"></td><td class="left">3. Result from compiled is -5676.66598645 in 97.7380275726 (msec)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> math-test.py</h2>
<div class="outline-text-2" id="text-12">


<p>
Note: these algorithms do not scale linearly with N
</p>
<p>
All times are in seconds
</p>

</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> sqrt</h3>
<div class="outline-text-3" id="text-12-1">


<p>
N = 10000
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="right">Python</th><th scope="col" class="right">Numba</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="right">0.00170588493347</td><td class="right">0.0743989944458</td></tr>
<tr><td class="left"></td><td class="right">0.00174593925476</td><td class="right">0.0611250400543</td></tr>
<tr><td class="left"></td><td class="right">0.00184512138367</td><td class="right">0.0618748664856</td></tr>
<tr><td class="left"></td><td class="right">0.00171184539795</td><td class="right">0.061408996582</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="right">0.00159692764282</td><td class="right">0.0599839687347</td></tr>
<tr><td class="left"></td><td class="right">0.00173020362854</td><td class="right">0.0594990253448</td></tr>
<tr><td class="left"></td><td class="right">0.0017421245575</td><td class="right">0.0599339008331</td></tr>
<tr><td class="left"></td><td class="right">0.00250196456909</td><td class="right">0.0624308586121</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="right">0.00171399116516</td><td class="right">0.0785949230194</td></tr>
<tr><td class="left"></td><td class="right">0.00183892250061</td><td class="right">0.0675189495087</td></tr>
<tr><td class="left"></td><td class="right">0.00175094604492</td><td class="right">0.0603921413422</td></tr>
<tr><td class="left"></td><td class="right">0.00170612335205</td><td class="right">0.0645940303802</td></tr>
</tbody>
</table>



</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> log</h3>
<div class="outline-text-3" id="text-12-2">


<p>
N = 10000
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Numba Version</th><th scope="col" class="right">Python</th><th scope="col" class="right">Numba</th></tr>
</thead>
<tbody>
<tr><td class="left">0.9.0</td><td class="right">0.00211095809937</td><td class="right">0.0557370185852</td></tr>
<tr><td class="left"></td><td class="right">0.00212287902832</td><td class="right">0.0526371002197</td></tr>
<tr><td class="left"></td><td class="right">0.00207209587097</td><td class="right">0.0515320301056</td></tr>
<tr><td class="left"></td><td class="right">0.0022120475769</td><td class="right">0.0550639629364</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.1</td><td class="right">0.0021059513092</td><td class="right">0.0521640777588</td></tr>
<tr><td class="left"></td><td class="right">0.00208806991577</td><td class="right">0.0521259307861</td></tr>
<tr><td class="left"></td><td class="right">0.00212788581848</td><td class="right">0.0508341789246</td></tr>
<tr><td class="left"></td><td class="right">0.00238919258118</td><td class="right">0.05242395401</td></tr>
</tbody>
<tbody>
<tr><td class="left">0.8.0</td><td class="right">0.00207805633545</td><td class="right">0.0496821403503</td></tr>
<tr><td class="left"></td><td class="right">0.00223398208618</td><td class="right">0.0613958835602</td></tr>
<tr><td class="left"></td><td class="right">0.00210213661194</td><td class="right">0.0539150238037</td></tr>
<tr><td class="left"></td><td class="right">0.00217890739441</td><td class="right">0.0513410568237</td></tr>
</tbody>
</table>



</div>

</div>
